### Q1

In [69]:
import pandas as pd

In [70]:
d1a = pd.read_csv('Lab2 D1A.csv')
d1b = pd.read_csv('Lab2 D1B.csv')
d1c = pd.read_csv('Lab2 D1C.csv')

In [71]:
d1a.head()

,fid,name,population,county,latitude
0,9001,NEW ENGLAND CHRISTIAN ACADEMY,136,BRISTOL,41.758597
1,9002,SETON ACADEMY FOR GIRLS,57,BRISTOL,41.718407
2,9003,ST ANNA SCHOOL,157,WORCESTER,42.517271
3,9004,SOUTHEAST ALTERNATIVE SCHOOL-MIDDLE SCHOOL,5,PLYMOUTH,41.818210
4,9005,DEVEREUX SCHOOL,123,WORCESTER,42.383875

In [72]:
d1b.head()

,name,population,county,longitude,level,enrollment,level.1
0,NEW ENGLAND CHRISTIAN ACADEMY,136,BRISTOL,-71.175801,Combined elementary and secondary,120,Combined elementary and secondary
1,SETON ACADEMY FOR GIRLS,57,BRISTOL,-71.147302,Elementary,49,Elementary
2,ST ANNA SCHOOL,157,WORCESTER,-71.751741,Elementary,143,Elementary
3,SOUTHEAST ALTERNATIVE SCHOOL-MIDDLE SCHOOL,5,PLYMOUTH,-71.083393,Elementary,4,Elementary
4,DEVEREUX SCHOOL,123,WORCESTER,-71.968419,Combined elementary and secondary,107,Combined elementary and secondary

In [73]:
d1a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26983 entries, 0 to 26982
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   fid         26983 non-null  int64
 1   name        26983 non-null  object
 2   population  26983 non-null  int64
 3   county      26983 non-null  object
 4   latitude    26983 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 1.0+ MB

In [74]:
d1b.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26983 entries, 0 to 26982
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        26983 non-null  object
 1   population  26983 non-null  int64
 2   county      26983 non-null  object
 3   longitude   26983 non-null  float64
 4   level       26983 non-null  object
 5   enrollment  26983 non-null  int64
 6   level.1     26983 non-null  object
dtypes: float64(1), int64(2), object(4)
memory usage: 1.4+ MB

In [75]:
set(d1a.columns).intersection(set(d1b.columns))

{'county', 'name', 'population'}

In [76]:
mergedData = d1a.merge(d1b, how = "inner", on = ["name", "population", "county"])

In [77]:
mergedData

,fid,name,population,county,latitude,longitude,level,enrollment,level.1
0,9001,NEW ENGLAND CHRISTIAN ACADEMY,136,BRISTOL,41.758597,-71.175801,Combined elementary and secondary,120,Combined elementary and secondary
1,9002,SETON ACADEMY FOR GIRLS,57,BRISTOL,41.718407,-71.147302,Elementary,49,Elementary
2,9003,ST ANNA SCHOOL,157,WORCESTER,42.517271,-71.751741,Elementary,143,Elementary
3,9004,SOUTHEAST ALTERNATIVE SCHOOL-MIDDLE SCHOOL,5,PLYMOUTH,41.818210,-71.083393,Elementary,4,Elementary
4,9005,DEVEREUX SCHOOL,123,WORCESTER,42.383875,-71.968419,Combined elementary and secondary,107,Combined elementary and secondary
...,...,...,...,...,...,...,...,...,...
27028,20996,MOST PRECIOUS BLOOD,33,WAUPACA,44.386281,-88.739200,Elementary,28,Elementary
27029,20997,STARR ACADEMY,29,WAUPACA,44.308621,-88.848294,Secondary,21,Secondary
27030,20998,ST JOHN'S LUTHERAN SCHOOL,24,WAUSHARA,44.202182,-88.886093,Elementary,22,Elementary
27031,20999,FAITH CHRISTIAN ACADEMY,13,WAUSHARA,44.074503,-89.294984,Elementary,11,Elementary
27032,21000,SHADY PINE SCHOOL,17,WAUSHARA,44.014975,-89.377692,Elementary,16,Elementary

In [78]:
mergedData.columns
mergedData.shape

(27033, 9)

In [79]:
commonCols = list(set(d1a.columns) & set(d1c.columns))

In [80]:
commonCols

['county']

In [81]:
comboAC = pd.merge(d1a, d1c, how = 'inner', on = commonCols)

In [82]:
comboAC.columns

Index(['fid', 'name', 'population', 'county', 'latitude', 'city', 'score'], dtype='object')

In [83]:
comboAC.shape

(4221333, 7)